In [1]:
import pandas as pd
import os

In [2]:
file = '/Users/nataliebernal/Desktop/git/Data_Analytics_Final_Project/book_crossing_files/original_csv/BX-Book-Ratings.csv'        

# Determine what the character encoding is
import chardet
with open(file, 'rb') as rawdata:
    result = chardet.detect(rawdata.read(100000))
result

# Insert sep to seperate data, character encoding, and skip bad lines
books = pd.read_csv(file, sep=";",encoding='ISO-8859-1', on_bad_lines='skip')

In [3]:
# Display DataFrame
books.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [4]:
books.describe()

            User-ID   Book-Rating
count  1.149780e+06  1.149780e+06
mean   1.403864e+05  2.866950e+00
std    8.056228e+04  3.854184e+00
min    2.000000e+00  0.000000e+00
25%    7.034500e+04  0.000000e+00
50%    1.410100e+05  0.000000e+00
75%    2.110280e+05  7.000000e+00
max    2.788540e+05  1.000000e+01

In [5]:
# Check for duplicates
print(f"Duplicate entries: {books.duplicated().sum()}")

Duplicate entries: 0

In [6]:
books_clean = books.dropna()

In [7]:
for column in books_clean.columns:
    print(f"Column {column} has {books_clean[column].isnull().sum()} null values")

Column User-ID has 0 null values
Column ISBN has 0 null values
Column Book-Rating has 0 null values

In [8]:
# Print the total number of tradable cryptocurrencies.
print(f"There are {books_clean['User-ID'].unique().size} users")

There are 105283 users

In [9]:
books_clean = books_clean.rename(columns={"User-ID": "user_id", "ISBN": "isbn", "Book-Rating": "book_rating"})

books_clean

         user_id         isbn  book_rating
0         276725   034545104X            0
1         276726   0155061224            5
2         276727   0446520802            0
3         276729   052165615X            3
4         276729   0521795028            6
...          ...          ...          ...
1149775   276704   1563526298            9
1149776   276706   0679447156            0
1149777   276709   0515107662           10
1149778   276721   0590442449           10
1149779   276723  05162443314            8

[1149780 rows x 3 columns]

In [10]:
books_clean.set_index('user_id')

                isbn  book_rating
user_id
276725    034545104X            0
276726    0155061224            5
276727    0446520802            0
276729    052165615X            3
276729    0521795028            6
...              ...          ...
276704    1563526298            9
276706    0679447156            0
276709    0515107662           10
276721    0590442449           10
276723   05162443314            8

[1149780 rows x 2 columns]

In [11]:
# Set the output file name
output_data_file = "/Users/nataliebernal/Desktop/git/Data_Analytics_Final_Project/book_crossing_files/csv/book_ratings.csv"
# Export the city_data DataFrame into a CSV file
books_clean.to_csv(output_data_file)